{"id":1389,"date":"2017-05-01T12:02:56","date_gmt":"2017-05-01T12:02:56","guid":{"rendered":"http:\/\/www.dentistinmeerut.com\/?page_id=1389"},"modified":"2017-05-14T19:09:52","modified_gmt":"2017-05-14T19:09:52","slug":"implant-dentistry","status":"publish","type":"page","link":"http:\/\/www.dentistinmeerut.com\/about-us\/implant-dentistry\/","title":{"rendered":"Implant Dentistry"},"content":{"rendered":"<p>[vc_row][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<img loading=\"lazy\" class=\"alignleft\" src=\"http:\/\/smilecraze.in\/images\/implant_dentistry.jpg\" width=\"136\" height=\"147\" \/><\/p>\n<p><strong>Overview :<\/strong><\/p>\n<p>Dental implant is one of the best method to fix tooth\/ teeth with similar functionality and beauty. It is one of the best cosmetic dentistry, with all natural looks and tooth\/ teeth performance. In dentistry, it is also considered to be an simulation of natural teeth with similar bone or jaw as the root.<\/p>\n<p>A dental implant is a titanium post (like a tooth root) that is surgically positioned into the jawbone beneath the gum line that allows your dentist to mount replacement teeth or a bridge into that area. The mechanics are exactly similar to how a natural tooth anchors itself, and therefore, dental implants are the ideal tooth\/teeth  replacement solution.<\/p>\n<p><strong>Successful replacement of teeth with implants is an extremely &#8216;technique sensitive&#8217; process, requiring great expertise !!<\/strong><\/p>\n<p><strong>Instantly reverse the age &#8212;&#8211; <\/strong> With missing teeth, the face has a sunken appearance and a person looks much older than he or she actually is. With dental implants, this is reversed immediately and a well balanced, natural and radiant smile is gained. This process alone would make one look at least 20 years younger !<\/p>\n<p><strong>Lifelong solution. Implants are a one-time procedure. Once done, they last a lifetime  !!<\/strong><\/p>\n<p><strong>Aesthetics in Dental Implant :<\/strong><br \/>\nWe believe that implants are not just about replacing teeth. They are about replacing them with ones that look absolutely stunning! This requires a perfect blend of an artistic mind with surgical genius. So, all implant cases at Smile Dental Care are performed by a team comprising of aesthetic dentist and implantologist. Each has acquired mastery in his\/her respective fields and this combination brings about results that are absolutely stunning and undoubtedly unmatched.<\/p>\n<p>WE ONLY USE THOSE IMPLANT SYSTEMS WHICH MEET THE MOST STRINGENT OF INTERNATIONAL QUALITY STANDARDS. SOME OF THE BRANDS THAT WE USE ARE.<\/p>\n<p>Myirad Implants (Equinox), Biotec Implants, Osstem Implants,  Nobel Biocare, Basal Implants (IHDE) etc.<\/p>\n<p><strong>Use of  3D CBCT Scan in Implant Dentistry :<\/strong><br \/>\n<strong>3D CBCT<\/strong> Scan add another dimension to implant technology. <strong>3D CBCT<\/strong> is absolutely vital for accurate planning and the placement of implants. They also help in the accurate evaluation of critical structures like nerves, teeth roots, sinus etc., thereby eliminating any chances of failure occurring due to misdiagnosis. Another vital diagnostic tool we use in implant treatment planing are <strong>OPG(Panaromic view)<\/strong> and patients <strong>study models<\/strong>.<\/p>\n<p>Depending on the technology used, implants at Smile Dental Care are categorized into<strong> 3 types,<\/strong> based on the <strong>time<\/strong> required:<\/p>\n<p><strong>Two stage implants :<\/strong> The procedure is carried out in two stages spread over a minimum interval of <strong>3 months<\/strong>. The first stage involves the placement of the implants and requires one to two sessions. The second stage involves the fabrication of the crowns (teeth). This is an obsolete technology and only used in those few cases where single stage implants are clinically not possible.<br \/>\n<strong>Single stage implants <\/strong>: The latest in dental implant technology, this involves completion of the entire procedure, right from extractions, implant placements and fabrication of the crowns (teeth) in one stage of approximately <strong>two to three weeks<\/strong>. This system can be used for almost all types and categories of cases.<br \/>\n<strong>Immediate implants :<\/strong> This is a specialized technique, allowing teeth to be replaced in a <strong>single day.<\/strong> Most cases are eligible for this technique; however, scans and evaluation are required to confirm this. This system is a revolutionary concept that combines precision surgery with specialized implants for immediate results.<\/p>\n<p>When it comes to replacement of teeth with implants, each individual has unique needs. Whether it is the extent and quality of the bone, the relation of jaws, an individual&#8217;s preference, time constraints or budget, there are hundreds of possible situations, each requiring a customized solution. We are well equipped to cater to any situation through our broad range of expertise.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>ALL ON 4 IMPLANTS<\/strong><\/p>\n<p>This is a brilliant alternative for people who are seeking a better alternative to dentures, but do not want to opt for full mouth implants and crowns.<\/p>\n<p><strong>What is the All-on-4  treatment concept ?<\/strong><\/p>\n<p>The All-on-4 treatment concept is a cost-efficient, low invasive, graftless solution that provides patients with a fixed full-arch prosthesis on the day of surgery.<\/p>\n<p>Characteristics include :<\/p>\n<ul>\n<li>Full-arch rehabilitation with only four implants.<\/li>\n<li>Two straight anterior implants and two implants tilted up to 45º in the posterior.<\/li>\n<li>Immediate Function (fixed screw retained provisional bridge right after the surgery).<\/li>\n<li>Graftless treatment &#8211; a less invasive procedure approach requiring only one surgical intervention and no augmentation procedures.<\/li>\n<li>Bone grafting is avoided by tilting the posterior implants, utilizing available bone.<\/li>\n<li>For patients meeting criteria for immediate loading of implants.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p><strong>BASAL IMPLANTS (IHDE IMPLANT  SYSTEM)<\/strong><\/p>\n<p>This Swiss based system breaks through the limitations of conventional implant systems and allows placement of implants even where minimal bone is present.Basal Implants also known as Cortical Implants are an advanced implantology system which make use of the basal(cortical) portion of the jaw bones for the strength of the dental implants that are distinctively designed to be placed in the basal(cortical) bone areas.With this system, no person can be refused implants on grounds of insufficient bone. Using this, we have provided permanent teeth to many people who have previously been rejected by others.<\/p>\n<p><strong>What are the  benefit of Basal Implants ??<\/strong><\/p>\n<ul>\n<li>Avoidance of Augmentation i.e bone graft procedures unless actually essential for esthetic reasons.<\/li>\n<li>Additional surgical risks are avoided.<\/li>\n<li>Cost effective &amp; saves time.<\/li>\n<li>Most advanced system.<\/li>\n<li>Well designed for immediate loading.<\/li>\n<li>Permanent fixed teeth within 5 to 7 days.<\/li>\n<li>High success rates in patients with less bone height, smokers &amp; those with gum disease.<\/li>\n<li>Employs cortical bone areas which are resistant to infection &amp; resorption.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>Useful purposes for Dental Implant :<\/p>\n<ul>\n<li>Replaces one or more teeth without affecting the neighbor teeth.<\/li>\n<li>Supports denture for more comfort and secure functionality.<\/li>\n<\/ul>\n<p>Dental Implants are the newest and most permanent way to replace missing teeth. Implants are basically artificial teeth that are surgically placed into the jaw bone and fuses with it.Dental implants are an ideal option for people in good general oral health who have lost a tooth or teeth due to periodontal (Gum) disease, failure of RCT, an injury, or some other reason.<\/p>\n<p>Dental implants are actually more tooth-saving than traditional bridgework, since implants do not rely on neighboring teeth for support.<\/p>\n<p><strong><img loading=\"lazy\" class=\"alignleft\" src=\"http:\/\/smilecraze.in\/images\/single_dental_implant.jpg\" width=\"136\" height=\"147\" \/>Single Dental Implant:<\/strong><br \/>\nThe single stage dental implant is designed in such a way that it enables avoiding the second surgery. During the single stage dental implant surgery, the implant is placed in the jaw bone in such a way that the top of the implant is higher than the surface of the bone and is actually at the height of the soft tissue (this is a longer implant).<\/p>\n<p>&nbsp;<\/p>\n<p><img loading=\"lazy\" class=\"alignleft\" src=\"http:\/\/smilecraze.in\/images\/multiple_dental_implant.jpg\" width=\"136\" height=\"147\" \/><br \/>\nMultiple Dental Implant:<br \/>\nJust as with one missing tooth, several missing teeth can be successfully treated with dental implants.  Implant supported teeth are permanently fixed in the mouth. Dental implants look, feel, and function like natural teeth, and can last a lifetime.<\/p>\n<p>&nbsp;<\/p>\n<p><strong><img loading=\"lazy\" class=\"alignleft\" src=\"http:\/\/smilecraze.in\/images\/implant_supported_dentures.jpg\" alt=\"\" width=\"136\" height=\"147\" \/><\/strong><strong>Implant-Supported Dentures:<\/strong><br \/>\nDentures (also known as false teeth) are prosthetic devices constructed to replace missing teeth, and which are supported by surrounding soft and hard tissues of the oral cavity. Conventional dentures are removable , however there are many different denture designs, some which rely on bonding or clasping onto teeth or dental implants. There are two main categories of dentures, depending on whether they are used to replace missing teeth on the mandibular arch or the maxillary arch. Implant supported dentures (or simply implant dentures) are a type of full overdenture that is secured in place by dental implants instead of simply resting on the gums as conventional dentures.[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/3&#8243;][stm_sidebar sidebar=&#8221;812&#8243;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column width=&#8221;2\/3&#8243;][vc_column_text] Overview : Dental implant is one of the best method to fix tooth\/ teeth with similar functionality and beauty. It is one of the best cosmetic dentistry, with all natural looks and tooth\/ teeth performance. In dentistry, it is also considered to be an simulation of natural teeth with similar bone or jaw&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":25,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/pages\/1389"}],"collection":[{"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/comments?post=1389"}],"version-history":[{"count":7,"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/pages\/1389\/revisions"}],"predecessor-version":[{"id":1928,"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/pages\/1389\/revisions\/1928"}],"up":[{"embeddable":true,"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/pages\/25"}],"wp:attachment":[{"href":"http:\/\/www.dentistinmeerut.com\/wp-json\/wp\/v2\/media?parent=1389"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}